In [1]:
import pandas as pd
import numpy as np
import datetime

t = datetime.datetime.now()
 
print ("Current date & time = {}".format(t))
 
print ("Date and time in ISO format = {}".format(t.isoformat()))
 
print ("Current year = {}".format(t.year))
                              
print ("Current month = {}".format(t.month))
 
print ("Current date (day) =  {}".format(t.day))
 
print ("dd/mm/yyyy format =  {}/{}/{}".format(t.day, t.month, t.year))
 
print ("Current hour = {}".format(t.hour))
 
print ("Current minute = {}".format(t.minute))
 
print ("Current second =  {}".format(t.second))
 
print ("hh:mm:ss format = {}:{}:{}".format(t.hour, t.month, t.second))

Current date & time = 2018-02-25 19:00:53.881245
Date and time in ISO format = 2018-02-25T19:00:53.881245
Current year = 2018
Current month = 2
Current date (day) =  25
dd/mm/yyyy format =  25/2/2018
Current hour = 19
Current minute = 0
Current second =  53
hh:mm:ss format = 19:2:53

In [2]:
str(t)[:10]

'2018-02-25'

In [3]:
df_customers = pd.read_csv('~/storage/downloads/code/ramen/CUSTOMERS.csv')

In [4]:
df_customers.head()

,id,title,first_name,last_name,gender,email,phone,street_suf,house_no,street_name,city,state,post_code,latitude,longitude
0,1,Mrs,Rhett,Dolle,Male,rdolle0@simplemachines.org,2697302942,Parkway,0,Green Ridge,Battle Creek,MI,49018,42.2464,-85.0045
1,2,Mr,Davina,Lambregts,Female,dlambregts1@cbslocal.com,4045423037,Court,6237,Fair Oaks,Atlanta,GA,30356,33.8913,-84.0746
2,3,Rev,Jess,Fullilove,Male,jfullilove2@discuz.net,7651645078,Point,7624,Sommers,Anderson,IN,46015,40.0938,-85.6578
3,4,Dr,Guillemette,Benedite,Female,gbenedite3@rambler.ru,2057386515,Point,8,Valley Edge,Birmingham,AL,35220,33.5446,-86.9292
4,5,Mr,Franny,Edmonds,Male,fedmonds4@storify.com,8061866575,Terrace,9896,Roxbury,Lubbock,TX,79410,33.5693,-101.8904

In [5]:
df_customers.groupby(['gender'])['gender'].count()

gender
Female    506
Male      494
Name: gender, dtype: int64

In [6]:
df_customers.pivot_table(columns='gender',
                        values='id',
                        aggfunc='count')

gender  Female  Male
id         506   494

In [7]:
#Merging Data (1 to 1)

In [8]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
display('df1', 'df2')

'df1'

'df2'

In [9]:
display(df1, df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [10]:
df3 = pd.merge(df1, df2)

In [11]:
df3.head()

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [12]:
#Merging Data (1 to many)

In [13]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
display(df3, df4)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [14]:
pd.merge(df3, df4)

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [15]:
display(df1, df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [16]:
pd.merge(df1, df2, on='employee')

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [17]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
display(df1, df3)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [18]:
pd.merge(df1, df3, left_on='employee', right_on='name')

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [19]:
pd.merge(df1, df3, left_on='employee', right_on='name').drop('name',axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [20]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])

In [21]:
display(df6, df7)

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

     name drink
0    Mary  wine
1  Joseph  beer

In [22]:
test1 = pd.merge(df6, df7, how='left')

test1.head(10)

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [23]:
#Look for nulls
test1.isnull().any()

name     False
food     False
drink     True
dtype: bool

In [24]:
pd.merge(df6, df7, how='outer')

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [25]:
pd.merge(df6, df7, how='inner').drop('food',axis=1)

   name drink
0  Mary  wine

In [26]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [1, 2, 3, 4]})
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue', 'Sally'],
                    'rank': [3, 1, 4, 2, 4]})

display(df8, df9)

pd.merge(df8, df9, on="name", suffixes=["_L", "_R"])

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

    name  rank
0    Bob     3
1   Jake     1
2   Lisa     4
3    Sue     2
4  Sally     4

   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [27]:
test5 = pd.merge(df9, df8, on='name', how='left', suffixes=['_1','_2'])

In [28]:
test5

    name  rank_1  rank_2
0    Bob       3     1.0
1   Jake       1     2.0
2   Lisa       4     3.0
3    Sue       2     4.0
4  Sally       4     NaN

In [29]:
test5['somecase'] = np.where((test5['name'] == 'Bob')
                             & (test5['rank_1'] >= 3)
                             , 'yes', 'no')
test5

    name  rank_1  rank_2 somecase
0    Bob       3     1.0      yes
1   Jake       1     2.0       no
2   Lisa       4     3.0       no
3    Sue       2     4.0       no
4  Sally       4     NaN       no